; ModuleID = 'struct_one2.ca'
source_filename = "struct_one2.ca"

%A22 = type { %AA, %A1, i8 }
%AA = type { i32, double, i8 }
%A1 = type { double, i32, i8 }
%A21 = type { i8, %AA, %A1 }
%C1 = type { i8 }
%A3 = type { %AA, %A1, %C1 }
%A2 = type { %AA, %A1 }

@0 = private unnamed_addr constant [2 x i8] c"C\00", align 1
@1 = private unnamed_addr constant [3 x i8] c"AA\00", align 1
@2 = private unnamed_addr constant [6 x i8] c"%s { \00", align 1
@3 = private unnamed_addr constant [3 x i8] c"f1\00", align 1
@4 = private unnamed_addr constant [5 x i8] c"%s: \00", align 1
@5 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@6 = private unnamed_addr constant [3 x i8] c", \00", align 1
@7 = private unnamed_addr constant [3 x i8] c"f2\00", align 1
@8 = private unnamed_addr constant [5 x i8] c"%s: \00", align 1
@9 = private unnamed_addr constant [4 x i8] c"%lf\00", align 1
@10 = private unnamed_addr constant [3 x i8] c", \00", align 1
@11 = private unnamed_addr constant [3 x i8] c"f3\00", align 1
@12 = private unnamed_addr constant [5 x i8] c"%s: \00", align 1
@13 = private unnamed_addr constant [3 x i8] c"%c\00", align 1
@14 = private unnamed_addr constant [3 x i8] c" }\00", align 1
@15 = private unnamed_addr constant [3 x i8] c"%c\00", align 1
@16 = private unnamed_addr constant [3 x i8] c"A1\00", align 1
@17 = private unnamed_addr constant [6 x i8] c"%s { \00", align 1
@18 = private unnamed_addr constant [3 x i8] c"f2\00", align 1

!0 = !{i32 2, !"Debug Info Version", i32 3}
!1 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "ca compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "struct_one2.ca", directory: ".")
!3 = !{}
!4 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 40, type: !5, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, retainedNodes: !8)
!5 = !DISubroutineType(types: !6)
!6 = !{!7}
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !18, !24, !29, !38, !39, !45, !51, !52, !53, !54, !56, !57, !59, !60, !61, !62}
!9 = !DILocalVariable(name: "a", scope: !4, file: !2, line: 41, type: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "AA", scope: !4, file: !2, line: 5, size: 192, elements: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !10, file: !2, line: 5, baseType: !13, size: 32)
!13 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !10, file: !2, line: 5, baseType: !15, size: 64, offset: 64)
!15 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !10, file: !2, line: 5, baseType: !17, size: 8, offset: 128)
!17 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed_char)
!18 = !DILocalVariable(name: "b", scope: !4, file: !2, line: 42, type: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "A1", scope: !4, file: !2, line: 5, size: 128, elements: !20)
!20 = !{!21, !22, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !19, file: !2, line: 5, baseType: !15, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !19, file: !2, line: 5, baseType: !13, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !19, file: !2, line: 5, baseType: !17, size: 8, offset: 96)
!24 = !DILocalVariable(name: "c", scope: !4, file: !2, line: 43, type: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "A2", scope: !4, file: !2, line: 5, size: 320, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !25, file: !2, line: 5, baseType: !10, size: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !25, file: !2, line: 5, baseType: !19, size: 128, offset: 192)
!29 = !DILocalVariable(name: "a3", scope: !4, file: !2, line: 44, type: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "A3", scope: !4, file: !2, line: 5, size: 384, elements: !31)
!31 = !{!32, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !30, file: !2, line: 5, baseType: !10, size: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !30, file: !2, line: 5, baseType: !19, size: 128, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !30, file: !2, line: 5, baseType: !35, size: 8, offset: 320)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "C1", scope: !4, file: !2, line: 5, size: 8, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !35, file: !2, line: 5, baseType: !17, size: 8)
!38 = !DILocalVariable(name: "c1", scope: !4, file: !2, line: 45, type: !35)
!39 = !DILocalVariable(name: "a21", scope: !4, file: !2, line: 47, type: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "A21", scope: !4, file: !2, line: 5, size: 384, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !40, file: !2, line: 5, baseType: !17, size: 8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !40, file: !2, line: 5, baseType: !10, size: 192, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !40, file: !2, line: 5, baseType: !19, size: 128, offset: 256)
!45 = !DILocalVariable(name: "a22", scope: !4, file: !2, line: 48, type: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "A22", scope: !4, file: !2, line: 5, size: 384, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !46, file: !2, line: 5, baseType: !10, size: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !46, file: !2, line: 5, baseType: !19, size: 128, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !46, file: !2, line: 5, baseType: !17, size: 8, offset: 320)
!51 = !DILocalVariable(name: "f1", scope: !4, file: !2, line: 56, type: !15)
!52 = !DILocalVariable(name: "f2", scope: !4, file: !2, line: 57, type: !13)
!53 = !DILocalVariable(name: "f21", scope: !4, file: !2, line: 58, type: !15)
!54 = !DILocalVariable(name: "f3", scope: !4, file: !2, line: 59, type: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!56 = !DILocalVariable(name: "f4", scope: !4, file: !2, line: 60, type: !15)
!57 = !DILocalVariable(name: "sa", scope: !4, file: !2, line: 62, type: !58)
!58 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!59 = !DILocalVariable(name: "sb", scope: !4, file: !2, line: 63, type: !58)
!60 = !DILocalVariable(name: "sc", scope: !4, file: !2, line: 64, type: !58)
!61 = !DILocalVariable(name: "sa3", scope: !4, file: !2, line: 65, type: !58)
!62 = !DILocalVariable(name: "sc1", scope: !4, file: !2, line: 66, type: !58)
!63 = !DILocation(line: 41, column: 30, scope: !4)
!64 = !DILocation(line: 41, scope: !4)
!65 = !DILocation(line: 42, column: 30, scope: !4)
!66 = !DILocation(line: 42, scope: !4)
!67 = !DILocation(line: 43, column: 33, scope: !4)
!68 = !DILocation(line: 43, column: 52, scope: !4)
!69 = !DILocation(line: 43, scope: !4)
!70 = !DILocation(line: 44, column: 33, scope: !4)
!71 = !DILocation(line: 44, column: 52, scope: !4)
!72 = !DILocation(line: 44, column: 61, scope: !4)
!73 = !DILocation(line: 44, scope: !4)
!74 = !DILocation(line: 45, column: 20, scope: !4)
!75 = !DILocation(line: 45, scope: !4)
!76 = !DILocation(line: 47, column: 32, scope: !4)
!77 = !DILocation(line: 47, scope: !4)
!78 = !DILocation(line: 48, column: 32, scope: !4)
!79 = !DILocation(line: 48, scope: !4)
!80 = !DILocation(line: 49, column: 17, scope: !4)
!81 = !DILocation(line: 50, column: 20, scope: !4)
!82 = !DILocation(line: 51, column: 20, scope: !4)
!83 = !DILocation(line: 52, column: 17, scope: !4)
!84 = !DILocation(line: 53, column: 20, scope: !4)
!85 = !DILocation(line: 54, column: 20, scope: !4)
!86 = !DILocation(line: 56, column: 24, scope: !4)
!87 = !DILocation(line: 56, scope: !4)
!88 = !DILocation(line: 57, column: 23, scope: !4)
!89 = !DILocation(line: 57, scope: !4)
!90 = !DILocation(line: 58, column: 25, scope: !4)
!91 = !DILocation(line: 58, scope: !4)
!92 = !DILocation(line: 59, column: 16, scope: !4)
!93 = !DILocation(line: 59, scope: !4)
!94 = !DILocation(line: 60, column: 24, scope: !4)
!95 = !DILocation(line: 60, scope: !4)
!96 = !DILocation(line: 62, column: 23, scope: !4)
!97 = !DILocation(line: 62, scope: !4)
!98 = !DILocation(line: 63, column: 23, scope: !4)
!99 = !DILocation(line: 63, scope: !4)
!100 = !DILocation(line: 64, column: 23, scope: !4)
!101 = !DILocation(line: 64, scope: !4)
!102 = !DILocation(line: 65, column: 24, scope: !4)
!103 = !DILocation(line: 65, scope: !4)
!104 = !DILocation(line: 66, column: 24, scope: !4)
!105 = !DILocation(line: 66, scope: !4)
!106 = !DILocation(line: 68, column: 12, scope: !4)
!107 = !DILocation(line: 68, column: 24, scope: !4)
!108 = !DILocation(line: 69, column: 12, scope: !4)
!109 = !DILocation(line: 69, column: 24, scope: !4)
!110 = !DILocation(line: 70, column: 12, scope: !4)
!111 = !DILocation(line: 70, column: 24, scope: !4)
!112 = !DILocation(line: 71, column: 13, scope: !4)
!113 = !DILocation(line: 71, column: 25, scope: !4)
!114 = !DILocation(line: 72, column: 13, scope: !4)
!115 = !DILocation(line: 72, column: 25, scope: !4)
!116 = !DILocation(line: 73, column: 14, scope: !4)
!117 = !DILocation(line: 73, column: 26, scope: !4)
!118 = !DILocation(line: 74, column: 14, scope: !4)
!119 = !DILocation(line: 74, column: 26, scope: !4)
!120 = !DILocation(line: 75, column: 13, scope: !4)
!121 = !DILocation(line: 75, column: 24, scope: !4)
!122 = !DILocation(line: 76, column: 13, scope: !4)
!123 = !DILocation(line: 76, column: 24, scope: !4)
!124 = !DILocation(line: 77, column: 13, scope: !4)
